// new Date();// объект класса Date а в классе есть команды .getFullYear()
//? Тип данных 
// number - числа
// string - строковый 
// boolean - у него всегда два значение true и false

// infinity - при делении на ноль
// NaN -  не коректное значение
// Null - ничего
// undefined - если не чего не присвоенно(значение не определенно)

//? Операторы
// = присваивание
// + сложение и склеивание
// == сравнение переменных
// /  != оператор отрицания
// % деление по модулю,дает остаток от деления
//* Арифметические операторы
// ++X увиличение на еденицу, посфиксная форма икримента
// X-- уменьшает на еденицу,  форма икримента декримент
//* Логический оператор 
// && и 
// || или


//? Вывод - Конструкции
alert("Привет"); //Вывод в окошки браузера
document.write('') // Вывожит на страницу браузера, document - страничка .write - записать
console.log(''); // вывод в консоль


//? Переменные 
var // var объявляет переменную  ES5
let // var объявляет переменную  ES6


//? Функции
prompt() // выводит сообщение и ждёт, пока пользователь введёт текст, а затем возвращает введённое значение или null
parseInt() // тоже самое что + только отбрасывает дробную часть
parseFloat() // принимает числом, и дробные
isNaN(age) // если получим true - значит ввели строку, а если false - то число



//? Команда 
typeof(x); // Команда что бы получить тип данных